payment-api-service/load-test/results/idempotency-2026-09-09.txt
==> starting Postgres and Redis
==> building the application jar
==> booting the app on :8081
==> waiting for the app..... - up
==> running k6 (50 VUs, 30s per scenario)

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 2 scenarios, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * create: 50 looping VUs for 30s (exec: createPath, gracefulStop: 30s)
              * replay: 50 looping VUs for 30s (exec: replayPath, startTime: 30s, gracefulStop: 30s)


Run      [ 100% ] setup()
create   [   0% ]
replay   [   0% ]

running (0m02.0s), 050/100 VUs, 414 complete and 0 interrupted iterations
create   [   3% ] 50 VUs   00.9s/30s
replay • [   0% ] waiting  29.1s

running (0m03.0s), 050/100 VUs, 723 complete and 0 interrupted iterations
create   [   6% ] 50 VUs   01.9s/30s
replay • [   0% ] waiting  28.1s

running (0m04.0s), 050/100 VUs, 1142 complete and 0 interrupted iterations
create   [  10% ] 50 VUs   02.9s/30s
replay • [   0% ] waiting  27.1s

running (0m05.0s), 050/100 VUs, 1619 complete and 0 interrupted iterations
create   [  13% ] 50 VUs   03.9s/30s
replay • [   0% ] waiting  26.1s

running (0m06.0s), 050/100 VUs, 2170 complete and 0 interrupted iterations
create   [  16% ] 50 VUs   04.9s/30s
replay • [   0% ] waiting  25.1s

running (0m07.0s), 050/100 VUs, 2355 complete and 0 interrupted iterations
create   [  20% ] 50 VUs   06.0s/30s
replay • [   0% ] waiting  24.0s

running (0m08.0s), 050/100 VUs, 2487 complete and 0 interrupted iterations
create   [  23% ] 50 VUs   07.0s/30s
replay • [   0% ] waiting  23.0s

running (0m09.0s), 050/100 VUs, 2896 complete and 0 interrupted iterations
create   [  26% ] 50 VUs   07.9s/30s
replay • [   0% ] waiting  22.1s

running (0m10.0s), 050/100 VUs, 3560 complete and 0 interrupted iterations
create   [  30% ] 50 VUs   08.9s/30s
replay • [   0% ] waiting  21.1s

running (0m11.0s), 050/100 VUs, 3923 complete and 0 interrupted iterations
create   [  33% ] 50 VUs   09.9s/30s
replay • [   0% ] waiting  20.1s

running (0m12.0s), 050/100 VUs, 4385 complete and 0 interrupted iterations
create   [  36% ] 50 VUs   10.9s/30s
replay • [   0% ] waiting  19.1s

running (0m13.0s), 050/100 VUs, 5213 complete and 0 interrupted iterations
create   [  40% ] 50 VUs   11.9s/30s
replay • [   0% ] waiting  18.1s

running (0m14.0s), 050/100 VUs, 6098 complete and 0 interrupted iterations
create   [  43% ] 50 VUs   12.9s/30s
replay • [   0% ] waiting  17.1s

running (0m15.0s), 050/100 VUs, 7127 complete and 0 interrupted iterations
create   [  46% ] 50 VUs   13.9s/30s
replay • [   0% ] waiting  16.1s

running (0m16.0s), 050/100 VUs, 8135 complete and 0 interrupted iterations
create   [  50% ] 50 VUs   14.9s/30s
replay • [   0% ] waiting  15.1s

running (0m17.0s), 050/100 VUs, 9100 complete and 0 interrupted iterations
create   [  53% ] 50 VUs   15.9s/30s
replay • [   0% ] waiting  14.1s

running (0m18.0s), 050/100 VUs, 10205 complete and 0 interrupted iterations
create   [  56% ] 50 VUs   16.9s/30s
replay • [   0% ] waiting  13.1s

running (0m19.0s), 050/100 VUs, 11762 complete and 0 interrupted iterations
create   [  60% ] 50 VUs   17.9s/30s
replay • [   0% ] waiting  12.1s

running (0m20.0s), 050/100 VUs, 13113 complete and 0 interrupted iterations
create   [  63% ] 50 VUs   18.9s/30s
replay • [   0% ] waiting  11.1s

running (0m21.0s), 050/100 VUs, 14166 complete and 0 interrupted iterations
create   [  66% ] 50 VUs   19.9s/30s
replay • [   0% ] waiting  10.1s

running (0m22.0s), 050/100 VUs, 14927 complete and 0 interrupted iterations
create   [  70% ] 50 VUs   20.9s/30s
replay • [   0% ] waiting  09.1s

running (0m23.0s), 050/100 VUs, 16463 complete and 0 interrupted iterations
create   [  73% ] 50 VUs   21.9s/30s
replay • [   0% ] waiting  08.1s

running (0m24.0s), 050/100 VUs, 18180 complete and 0 interrupted iterations
create   [  76% ] 50 VUs   22.9s/30s
replay • [   0% ] waiting  07.1s

running (0m25.0s), 050/100 VUs, 19473 complete and 0 interrupted iterations
create   [  80% ] 50 VUs   23.9s/30s
replay • [   0% ] waiting  06.1s

running (0m26.0s), 050/100 VUs, 20549 complete and 0 interrupted iterations
create   [  83% ] 50 VUs   24.9s/30s
replay • [   0% ] waiting  05.1s

running (0m27.0s), 050/100 VUs, 21932 complete and 0 interrupted iterations
create   [  86% ] 50 VUs   25.9s/30s
replay • [   0% ] waiting  04.1s

running (0m28.0s), 050/100 VUs, 23085 complete and 0 interrupted iterations
create   [  90% ] 50 VUs   26.9s/30s
replay • [   0% ] waiting  03.1s

running (0m29.0s), 050/100 VUs, 24270 complete and 0 interrupted iterations
create   [  93% ] 50 VUs   27.9s/30s
replay • [   0% ] waiting  02.1s

running (0m30.0s), 050/100 VUs, 25415 complete and 0 interrupted iterations
create   [  96% ] 50 VUs   28.9s/30s
replay • [   0% ] waiting  01.1s

running (0m31.0s), 050/100 VUs, 26576 complete and 0 interrupted iterations
create   [ 100% ] 50 VUs   29.9s/30s
replay • [   0% ] waiting  00.1s

running (0m32.0s), 050/100 VUs, 29306 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [   3% ] 50 VUs  00.9s/30s

running (0m33.0s), 050/100 VUs, 32791 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [   6% ] 50 VUs  01.9s/30s

running (0m34.0s), 050/100 VUs, 35612 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  10% ] 50 VUs  02.9s/30s

running (0m35.0s), 050/100 VUs, 39975 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  13% ] 50 VUs  03.9s/30s

running (0m36.0s), 050/100 VUs, 44375 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  16% ] 50 VUs  04.9s/30s

running (0m37.0s), 050/100 VUs, 49328 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  20% ] 50 VUs  05.9s/30s

running (0m38.0s), 050/100 VUs, 52701 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  23% ] 50 VUs  06.9s/30s

running (0m39.0s), 050/100 VUs, 56470 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  26% ] 50 VUs  07.9s/30s

running (0m40.0s), 050/100 VUs, 59735 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  30% ] 50 VUs  08.9s/30s

running (0m41.0s), 050/100 VUs, 63246 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  33% ] 50 VUs  09.9s/30s

running (0m42.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  36% ] 50 VUs  10.9s/30s

running (0m43.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  40% ] 50 VUs  11.9s/30s

running (0m44.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  43% ] 50 VUs  12.9s/30s

running (0m45.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  46% ] 50 VUs  13.9s/30s

running (0m46.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  50% ] 50 VUs  14.9s/30s

running (0m47.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  53% ] 50 VUs  15.9s/30s

running (0m48.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  56% ] 50 VUs  16.9s/30s

running (0m49.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  60% ] 50 VUs  17.9s/30s

running (0m50.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  63% ] 50 VUs  18.9s/30s

running (0m51.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  66% ] 50 VUs  19.9s/30s

running (0m52.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  70% ] 50 VUs  20.9s/30s

running (0m53.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  73% ] 50 VUs  21.9s/30s

running (0m54.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  76% ] 50 VUs  22.9s/30s

running (0m55.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  80% ] 50 VUs  23.9s/30s

running (0m56.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  83% ] 50 VUs  24.9s/30s

running (0m57.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  86% ] 50 VUs  25.9s/30s

running (0m58.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  90% ] 50 VUs  26.9s/30s

running (0m59.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  93% ] 50 VUs  27.9s/30s

running (1m00.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [  96% ] 50 VUs  28.9s/30s

running (1m01.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay   [ 100% ] 50 VUs  29.9s/30s

running (1m02.0s), 050/100 VUs, 63654 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m03.0s), 042/100 VUs, 63662 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m04.0s), 042/100 VUs, 63662 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m05.0s), 036/100 VUs, 63668 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m06.0s), 036/100 VUs, 63668 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m07.0s), 036/100 VUs, 63668 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m08.0s), 036/100 VUs, 63668 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m09.0s), 029/100 VUs, 63675 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m10.0s), 015/100 VUs, 63689 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s

running (1m11.0s), 004/100 VUs, 63700 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ↓ [ 100% ] 50 VUs  30s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=99.90%

    create_latency
    ✗ 'p(99)<250' p(99)=273.29ms

    replay_latency
    ✓ 'p(99)<150' p(99)=34.74ms


  █ TOTAL RESULTS 

    checks_total.......: 100654 1413.584338/s
    checks_succeeded...: 99.90% 100554 out of 100654
    checks_failed......: 0.09%  100 out of 100654

    ✓ create returned 201
    ✗ replay returned 201
      ↳  99% — ✓ 36900 / ✗ 50
    ✗ replay was served from the store
      ↳  99% — ✓ 36900 / ✗ 50

    CUSTOM
    create_latency.................: avg=55.9ms  min=5.27ms   med=40.68ms max=926.02ms p(90)=97.25ms p(95)=138.21ms
    replay_latency.................: avg=9ms     min=0s       med=7.15ms  max=134.19ms p(90)=16.06ms p(95)=20.58ms 

    HTTP
    http_req_duration..............: avg=28.71ms min=0s       med=13.92ms max=926.02ms p(90)=60.73ms p(95)=89.93ms 
      { expected_response:true }...: avg=28.74ms min=526.04µs med=13.96ms max=926.02ms p(90)=60.74ms p(95)=89.95ms 
    http_req_failed................: 0.07% 50 out of 63708
    http_reqs......................: 63708 894.714875/s

    EXECUTION
    iteration_duration.............: avg=52.5ms  min=561.12µs med=14.22ms max=30s      p(90)=61.31ms p(95)=91.06ms 
    iterations.....................: 63704 894.658699/s
    vus............................: 4     min=0           max=50 
    vus_max........................: 100   min=100         max=100

    NETWORK
    data_received..................: 40 MB 564 kB/s
    data_sent......................: 36 MB 501 kB/s



running (1m11.2s), 000/100 VUs, 63704 complete and 0 interrupted iterations
create ✓ [ 100% ] 50 VUs  30s
replay ✓ [ 100% ] 50 VUs  30s